tutorials/precursorABL/GABLS1.stable/0.original/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform $U0;

boundaryField
{
    bottom
    {
        type            velocityABLWallFunction;
        print           true;
        U               "U";
        value           $U0;
    }
    top
    {
        type            slip;
        value           $internalField;
    }
    west 
    {
        type            cyclic;
    }
    east 
    {
        type            cyclic;
    }
    north 
    {
        type            cyclic;
    }
    south
    {
        type            cyclic;
    }
}


// ************************************************************************* //
